nobbble/app/controllers/projxes_controller.rb

  def index
    @projxes = Projx.all.order("created_at DESC").paginate(:page => params[:page], :per_page => 5)
---
SELECT  "projxes".* FROM "projxes"  ORDER BY created_at DESC LIMIT 5 OFFSET 0

  def show
    # @projx = Projx.find(params[:id])
    @projx = Projx.where(created_at: 10.days.ago..Time.now).find(params[:id])
    @bscenes = Bscene.where(projx_id: @projx)
---
SELECT  "projxes".* FROM "projxes" WHERE ("projxes"."created_at" BETWEEN '2015-10-05 18:32:41.129194' AND '2015-10-15 18:32:41.129502') AND "projxes"."id" = ? LIMIT 1  [["id", 1]]
SELECT "bscenes".* FROM "bscenes" WHERE "bscenes"."projx_id" = 1

  def create
    @projx = current_user.projxes.build(projx_params)
    respond_to do |format|
      if @projx.save
---
INSERT INTO "projxes" ("title", "type_skill", "location", "description", "website", "date", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)